Repository: Bhanditz/gstreamer
Catalog: gstreamer/po/*.po
Languages: fr

source: Print the GStreamer version
fr: Afficher la version de GStreamer

source: Make all warnings fatal
fr: Rendre tout les avertissements bloquants

source: Default debug level from 1 (only error) to 5 (anything) or 0 for no output
fr: Niveau de deboguage par defaut de 1 (que les erreurs) a 5 (tout) ou 0 pour n'avoir aucun affichage

source: LEVEL
fr: NIVEAU

source: Comma-separated list of category_name:level pairs to set specific levels for the individual categories. Example: GST_AUTOPLUG:5,GST_ELEMENT_*:3
fr: Liste séparée par des virgules de paires nom_catégorie:niveau definissant des niveaux spécifiques pour chaque catégorie. Exemple: GST_AUTOPLUG:5,GST_ELEMENT_*:3

source: Disable color debugging output
fr: Désactiver la couleur dans la sortie de deboguage

source: Disable debugging
fr: Désactiver la sortie de deboguage

source: Print available debug categories and exit
fr: Afficher les catégories de deboguage disponibles et quitter

source: Disable accelerated CPU instructions
fr: Désactiver les instructions accélerées du processeur

source: Enable verbose plugin loading diagnostics
fr: Activer un diagnostique détaillé du chargement des plugins

source: path list for loading plugins (separated by '
fr: liste de chemins pour le chargement des plugins (séparés par '

source: PATHS
fr: CHEMINS

source: Comma-separated list of plugins to preload in addition to the list stored in env variable GST_PLUGIN_PATH
fr: Liste séparée par des virgules de plugins a precharger en plus de la liste contenue dans la variable d'environnement GST_PLUGIN_PATH

source: Disable trapping of segmentation faults during plugin loading
fr: Désactiver la detection des erreurs de segmentation pendant le chargement des plugins

source: Scheduler to use ('
fr: Planificateur a utiliser ('

source: ' is the default)
fr: ' est la valeur par defaut)

source: SCHEDULER
fr: PLANIFICATEUR

source: Registry to use
fr: Registre a utiliser

source: REGISTRY
fr: REGISTRE

source: Failed to change state
fr: Echoué a changer d'état

source: Could not determine type of stream
fr: Echoué a déterminer le type du flux

source: title
fr: titre

source: commonly used title
fr: titre utilisé habituellement

source: artist
fr: artiste

source: person(s) responsible for the recording
fr: personne(s) responsable(s) de l'enregistrement

source: album containing this data
fr: album contenant cette donnée

source: date the data was created (in Julian calendar days)
fr: date a laquelle la donnée fut créée (selon le calendrier Julienne)

source: genre this data belongs to
fr: genre auquel cette donnée appartient

source: comment
fr: commentaire

source: free text commenting the data
fr: texte libre décrivant la donnée

source: track number
fr: numéro de piste

source: track number inside a collection
fr: numéro de piste au sein d'une collection

source: track count
fr: nombre de pistes

source: count of tracks inside collection this track belongs to
fr: nombre de pistes dans la collection dont cette donnée fait partie

source: location
fr: emplacement

source: original location of file as a URI
fr: emplacement original du fichier en tant qu'un URI

source: short text describing the content of the data
fr: texte court décrivant le contenu de la donnée

source: version of this data
fr: version de cette donnée

source: International Standard Recording Code - see http://www.ifpi.org/isrc/
fr: International Standard Recording Code - voir http://www.ifpi.org/isrc/

source: organization
fr: organisation

source: copyright
fr: droit de copie

source: copyright notice of the data
fr: information sur le droit de copie de la donnée

source: contact information
fr: information sur le contact

source: license of data
fr: license de la donnée

source: performer
fr: interprète

source: person(s) performing
fr: personne(s) qui interprète(nt)

source: duration
fr: durèe

source: length in GStreamer time units (nanoseconds)
fr: longueur en unité de temps GStreamer (nanosecondes)

source: codec the data is stored in
fr: codec avec lequel la donnée fut enregistrée

source: minimum bitrate
fr: bitrate minimum

source: minimum bitrate in bits/s
fr: bitrate minimum en bits par seconde

source: exact or average bitrate in bits/s
fr: bitrate exact ou moyen en bits par seconde

source: maximum bitrate
fr: bitrate maximum

source: maximum bitrate in bits/s
fr: bitrate maximum en bits par seconde

source: caps
fr: capacités

source: detected capabilities in stream
fr: capacités detectées dans le flux

source: specified empty bin "%s", not allowed
fr: conteneur vide specifié "%s", non autorisé

source: no bin "%s", skipping
fr: pas de conteneur "%s", ignoré

source: no property "%s" in element "%s"
fr: pas de proprieté "%s" dans l'element "%s"

source: could not set property "%s" in element "%s" to "%s"
fr: impossible de definir la proprieté "%s" dans l'element "%s" comme "%s"

source: could not convert "%s" so that it fits property "%s" in element "%s"
fr: impossible de convertir "%s" de manière a correspondre avec la proprieté "%s" dans l'element "%s"

source: could not link %s to %s
fr: impossible de connecter %s a %s

source: no element "%s"
fr: pas d'element "%s"

source: could not parse caps "%s"
fr: impossible d'interpreter les capacités "%s"

source: link without source element
fr: lien sans element source

source: link without sink element
fr: lien sans element destination

source: no source element for URI "%s"
fr: pas d'element source pour l'URI "%s"

source: no element to link URI "%s" to
fr: pas d'element avec lequel lier l'URI "%s"

source: no sink element for URI "%s"
fr: pas d'element destination pour l'URI "%s"

source: could not link sink element for URI "%s"
fr: impossible de lier un element destination pour l'URI "%s"

source: empty pipeline not allowed
fr: tube vide non autorisé

source: Execution ended after %
fr: L'execution s'est terminé après %

source: iterations (sum %
fr: itérations (somme %

source: ns, average %
fr: ns, moyenne %

source: Usage: gst-xmllaunch <file.xml> [ element.property=value ... ]
fr: Utilisation: gst-xmllaunch <fichier.xml> [ element.property=valeur ... ]

source: ERROR: parse of xml file '%s' failed.
fr: ERREUR: l'interpretation du fichier xml '%s' a echoué.

source: ERROR: no toplevel pipeline element in file '%s'.
fr: ERREUR: pas d'element tube de plus haut niveau dans le fichier '%s'.

source: WARNING: only one toplevel element is supported at this time.
fr: AVERTISSEMENT: actuellement seul un element tube de plus haut niveau est supporté.

source: ERROR: could not parse command line argument %d: %s.
fr: ERREUR: impossible d'interpreter l'argument de la ligne de commande numero %d: %s.

source: WARNING: element named '%s' not found.
fr: AVERTISSEMENT: l'element nommé '%s' est introuvable.

source: FOUND TAG : found by element "%s".
fr: TAG DECOUVERT : decouvert par l'element "%s".

source: Output tags (also known as metadata)
fr: tags de sortie (aussi connus sous le nom de metadata)

source: Output status information and property notifications
fr: Afficher des informations sur le status et les notifications de proprietés

source: Do not output status information of TYPE
fr: Ne pas afficher d'informations sur les status de TYPE

source: Save xml representation of pipeline to FILE and exit
fr: Sauvegarder la representation xml du tube dans FICHIER et quitter

source: FILE
fr: FICHIER

source: Do not install a fault handler
fr: Ne pas installer un gestionaire de dysfonctionement

source: Print alloc trace (if enabled at compile time)
fr: Imprimer les traces d'allocations (si activées lors de la compilation)

source: Number of times to iterate pipeline
fr: Nombres d'iterations du tube a accomplir

source: ERROR: pipeline could not be constructed: %s.
fr: ERREUR: le tube n'a pas pu etre construit: %s.

source: ERROR: pipeline could not be constructed.
fr: ERREUR: le tube n'a pas pu etre construit.

source: WARNING: erroneous pipeline: %s
fr: AVERTISSEMENT: tube erroné: %s

source: Trying to run anyway.
fr: Tentative d'execution malgrè tout.

source: ERROR: the 'pipeline' element wasn't found.
fr: ERREUR: l'element 'tube' est introuvable.

source: RUNNING pipeline ...
fr: EXECUTION du tube en cours ...

source: ERROR: pipeline doesn't want to play.
fr: ERREUR: le tube refuse de s'executer.
